# -*- coding: utf-8 -*-

# Вывести на консоль жителей комнат (модули room_1 и room_2)
# Формат: В комнате room_1 живут: ...

from room_2 import folks as folks_name
from room_1 import folks as folks_name1
print(f'В комнате 1 живут: {folks_name1}')
print(f'В комнате 2 живут: {folks_name}')

