#Создать модуль my_burger. В нем определить функции добавления инградиентов:
#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра
# - buns
# - cutlets
# - cucumber
# - tomato
# - mayonnaise
# - cheese
# В каждой функции выводить на консоль что-то вроде "А теперь добавим ..."
def add_buns():
    print('А теперь добавим булочку')
def add_cutlets():
    print('А теперь добавим котлеты')
def add_cucumber():
    print('А теперь добавим огурец')
def add_tomato():
    print('А теперь добавим томаты')
def add_mayonnaise():
    print('А теперь добавим соус')
def add_cheese():
    print('А теперь добавим сир')