# -*- coding: utf-8 -*-

# Есть словарь кодов товаров

goods = {
    'Лампа': '12345',
    'Стол': '23456',
    'Диван': '34567',
    'Стул': '45678',
}

# Есть словарь списков количества товаров на складе.

store = {
    '12345': [
        {'quantity': 27, 'price': 42},
    ],
    '23456': [
        {'quantity': 22, 'price': 510},
        {'quantity': 32, 'price': 520},
    ],
    '34567': [
        {'quantity': 2, 'price': 1200},
        {'quantity': 1, 'price': 1150},
    ],
    '45678': [
        {'quantity': 50, 'price': 100},
        {'quantity': 12, 'price': 95},
        {'quantity': 43, 'price': 97},
    ],
}

# Рассчитать на какую сумму лежит каждого товара на складе.
#
# Вывести суммарную стоимость каждого товара на складе c помощью циклов
# То есть: всего по лампам, стульям, етс.
# Формат строки вывода: "<товар> - <кол-во> шт, стоимость <общая стоимость> руб"
#
# Алгоритм должен получиться приблизительно такой:
#
# цикл for по товарам с получением кода и названия товара
#     инициализация переменных для подсчета количества и стоимости товара
#     получение списка на складе по коду товара
#     цикл for по списку на складе
#         подсчет количества товара
#         подсчет стоимости товара
#     вывод на консоль количества и стоимости товара на складе

for good, number in goods.items():
    good_quantity = 0
    good_price = 0
    total_price = 0
    i = 0
    print(f'Наименование товара: {good}. Код товара: {number}')
    for good in store[number]:
        good_quantity += store[number][i]['quantity']
        good_price += store[number][i]['price']
        total_price = good_quantity * good_price
        print(f'Кол-во товаров {good_quantity}, цена за 1 шт. - {good_price}, общая сумма всех товаров {total_price}\n')
        i += 1


# for number in store:
#
#
#     for quantity in store[number]:
#
#         print(quantity)
#
#         print(store[number][0]) # показывает весь словарь
#         print(store[number][0]['quantity'])# показывает кол во из первого словаря по индексу 0







